; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 10943)
	(= (fuel plane1) 3486)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 16)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city4)
	(= (capacity plane2) 11244)
	(= (fuel plane2) 1062)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 15)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at plane3 city3)
	(= (capacity plane3) 2972)
	(= (fuel plane3) 339)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 3)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at plane4 city3)
	(= (capacity plane4) 10200)
	(= (fuel plane4) 1938)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 11)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 9)
	(at plane5 city5)
	(= (capacity plane5) 4607)
	(= (fuel plane5) 1112)
	(= (slow-burn plane5) 2)
	(= (fast-burn plane5) 4)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 6)
	(at person1 city0)
	(at person2 city5)
	(at person3 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 971)
	(= (distance city0 city2) 794)
	(= (distance city0 city3) 851)
	(= (distance city0 city4) 842)
	(= (distance city0 city5) 933)
	(= (distance city1 city0) 971)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 871)
	(= (distance city1 city3) 579)
	(= (distance city1 city4) 773)
	(= (distance city1 city5) 717)
	(= (distance city2 city0) 794)
	(= (distance city2 city1) 871)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 581)
	(= (distance city2 city4) 633)
	(= (distance city2 city5) 862)
	(= (distance city3 city0) 851)
	(= (distance city3 city1) 579)
	(= (distance city3 city2) 581)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 785)
	(= (distance city3 city5) 678)
	(= (distance city4 city0) 842)
	(= (distance city4 city1) 773)
	(= (distance city4 city2) 633)
	(= (distance city4 city3) 785)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 871)
	(= (distance city5 city0) 933)
	(= (distance city5 city1) 717)
	(= (distance city5 city2) 862)
	(= (distance city5 city3) 678)
	(= (distance city5 city4) 871)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city3)
	(at plane4 city1)
	(at person1 city1)
	(at person2 city3)
	(at person3 city2)
	))

(:metric minimize (+ (* 3 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane4 city3)
   changed: (fuel plane4) from 1938 to 10200
   goals met: 0 of 5
2. (fly plane4 city3 city1)
   deleted: (at plane4 city3)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 0 to 2316, (fuel plane4) from 10200 to 7884
   goals met: 1 of 5
3. (board person3 plane1 city3)
   deleted: (at person3 city3)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 5
4. (refuel plane2 city4)
   changed: (fuel plane2) from 1062 to 11244
   goals met: 1 of 5
5. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 2316 to 5221, (fuel plane1) from 3486 to 581
   goals met: 1 of 5
6. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (at person3 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 5
7. (fly plane4 city1 city0)
   deleted: (at plane4 city1)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 5221 to 9105, (fuel plane4) from 7884 to 4000
   goals met: 1 of 5
8. (board person1 plane4 city0)
   deleted: (at person1 city0)
   added: (in person1 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 1 of 5
9. (fly plane2 city4 city5)
   deleted: (at plane2 city4)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 9105 to 12589, (fuel plane2) from 11244 to 7760
   goals met: 1 of 5
10. (fly plane4 city0 city1)
   deleted: (at plane4 city0)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 12589 to 16473, (fuel plane4) from 4000 to 116
   goals met: 2 of 5
11. (debark person1 plane4 city1)
   deleted: (in person1 plane4)
   added: (at person1 city1)
   changed: (onboard plane4) from 1 to 0
   goals met: 3 of 5
12. (board person2 plane2 city5)
   deleted: (at person2 city5)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 5
13. (fly plane2 city5 city3)
   deleted: (at plane2 city5)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 16473 to 19185, (fuel plane2) from 7760 to 5048
   goals met: 4 of 5
14. (debark person2 plane2 city3)
   deleted: (in person2 plane2)
   added: (at person2 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 5
